squareCylinder_kEpsilon/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// epsilon = (0.164 * k**1.5)/ (0.07 L) -->
// epsilon = (0.164 * 0.00375**1.5) / (0.07 * 1) = 5.38e-4
//ep = 5.38e-4;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5.38e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 5.38e-4;
    }

    outlet
    {
        type            zeroGradient;

    }

    topWall
    {
        type            epsilonWallFunction;
        value           uniform 5.38e-4;
    }

    bottomWall
    {
        type            epsilonWallFunction;
        value           uniform 5.38e-4;
    }

    cylinderWall
    {
        type            epsilonWallFunction;
        value           uniform 5.38e-4;
    }

    frontAndBack
    {
        type            empty; 
    }
}


// ************************************************************************* //
